# LoadLinearLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadLinearLength Property
ParameterTypeId Class See Also
---
"Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadLinearLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadLinearLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadLinearLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace